# 1️⃣ Create a numeric vector of 5 elements
# Problem

# Create a vector:
#  10, 20, 30, 40, 50

# ✔ Solution:

x <- c(10,20,30,40,50)
print(x)

------------------------------------------------------------------------

# 2️⃣ Access the 3rd element of a vector
# ✔ Solution
x[3]

# ✔ Explanation
# R uses 1-based indexing.
------------------------------------------------------------------------
  
 # 3️⃣ Add 5 to each element

x <- c(10,20,30,40,50)
print(x+5)

------------------------------------------------------------------------

# 4️⃣ Create a logical vector checking which values are > 25:
  
x <- c(10,20,30,40,50)
print(x > 25)

------------------------------------------------------------------------
  
# 5️⃣ Replace all values greater than 30 with 0:
 
x <- c(10,20,30,40,50) 
x[x > 30] <- 0
x

---------------------------------------------------------------------------
  
#  6️⃣ Count how many TRUE values in a logical vector

x <- c(10,20,30,40,50) 
sum(x > 25)

---------------------------------------------------------------------------
  
 # 7️⃣ Create a vector with NA and remove NA
  
y <- c(1, NA, 3, NA)
y_na <- y[!is.na(y)]
y_na

-----------------------------------------------------------------------------
  
# 8️⃣ Create a 2×3 matrix
mat = matrix(1:6, nrow=2, ncol=3, byrow=TRUE)
mat

-----------------------------------------------------------------------------
  
# 9️⃣ Extract element at row 2, column 3

mat[2,3]

--------------------------------------------------------------------------

# 🔟 Add 2 to all matrix elements:
  
mat + 2

--------------------------------------------------------------------------
  
# 1️⃣1️⃣ Vector: return only even numbers

x <- c(1,2,3,4,5,6)
x[x%% 2==0]

--------------------------------------------------------------------------
  
# 1️⃣2️⃣ Multiply two vectors element-wise
  
x <- c(1,2,3,4)
y <- c(5,6,7,8)

z <- x * y
z

---------------------------------------------------------------------------
  
# 1️⃣3️⃣ Mean, median, SD of a vector
  
x <- c(1,2,3,4)
mean(x)
median(x)
sd(x)
  
----------------------------------------------------------------------------
  
# 1️⃣4️⃣ Logical vector: values between 10 and 30:
  
x <- c (10,20,30,40,50)
x[x >= 10 & x <= 30]
  
---------------------------------------------------------------------------
  
1️⃣5️⃣ Replace NA values with the mean

y <- c(1,2,NA, 5 ,NA)
y[is.na(y)] <- mean(y, na.rm=TRUE)
y


---------------------------------------------------------------------------
  
# 1️⃣6️⃣ Matrix: extract second row:
  
mat = matrix(1:6, nrow = 2, ncol=3, byrow=TRUE)
mat[2,]

----------------------------------------------------------------------------
# 1️⃣7️⃣ Matrix: extract 3 coulmn
  
mat = matrix(1:6, nrow = 2, ncol=3, byrow=TRUE)
mat[,3]

----------------------------------------------------------------------

# 1️⃣8️⃣ Matrix addition:

mat1 <- matrix(1:8, nrow=4 ,ncol= 2, byrow= TRUE)
mat2 <- matrix(8:6, nrow=4, ncol=2, byrow=TRUE)
mat1 + mat2

---------------------------------------------------------------------
  
#  1️⃣9️⃣ Multiply matrix by scalar
  
mat1 <- matrix(1:8, nrow=4 ,ncol= 2, byrow= TRUE)
mat1 * 5

---------------------------------------------------------------------

# 2️⃣0️⃣ Identify matrix elements greater than  4

mat1 <- matrix(1:8, nrow=4 ,ncol= 2, byrow= TRUE)  
mat1[mat1>4]

---------------------------------------------------------------------
  
 2️⃣1️⃣ Create a sequence of numbers from 5 to 50 with step 5:

x <- seq(1, 50, by = 5)
x

--------------------------------------------------------------------
  
2️⃣2️⃣ Reverse a vector

x <- c(1,2,3,4,5,6)
rev(x)

--------------------------------------------------------------------

# 2️⃣3️⃣ Standardize (z-score) without loops

x <- c(1,2,3,4,5,6)
z <- (x - mean(x))/ sd(x)
z
-------------------------------------------------------------------
  
# 2️⃣4️⃣ Remove duplicate elements
  
x <- c(1,2,3,4,5,6,6,5)
x[!duplicated(x)]

---------------------------------------------------------------------------
  
2️⃣5️⃣  Extract all positions where vector decreases:
  
x <- c(3,7,5,4,6,2)
which(x[-1] < x[-length(x)])
x

----------------------------------------------------------------------------
  
# 2️⃣7️⃣ Identify NA positions
x <- c(3,NA,NA,4,NA,2)  
which(is.na(x))

------------------------------------------------------------------------------
  
#⃣##  Create logical vector: values within 1 SD of mean
  
x <- c(10,2,3,4)

which(abs(x-mean(x)) <= sd(x))
  
------------------------------------------------------------------------------
  
# Drop rows that contain any NA
x <- c(1,23,3,NA,4,NA,6)
x[complete.cases(x)]

------------------------------------------------------------------------------
  

  
  
  
  
  